In [3]:
! pip install pandas

Requirement already satisfied: pandas in /opt/anaconda/envs/mlops/lib/python3.11/site-packages (2.3.3)
Requirement already satisfied: numpy>=1.23.2 in /opt/anaconda/envs/mlops/lib/python3.11/site-packages (from pandas) (2.3.4)
Requirement already satisfied: python-dateutil>=2.8.2 in /opt/anaconda/envs/mlops/lib/python3.11/site-packages (from pandas) (2.9.0.post0)
Requirement already satisfied: pytz>=2020.1 in /opt/anaconda/envs/mlops/lib/python3.11/site-packages (from pandas) (2025.2)
Requirement already satisfied: tzdata>=2022.7 in /opt/anaconda/envs/mlops/lib/python3.11/site-packages (from pandas) (2025.2)
Requirement already satisfied: six>=1.5 in /opt/anaconda/envs/mlops/lib/python3.11/site-packages (from python-dateutil>=2.8.2->pandas) (1.17.0)
WARNING: Running pip as the 'root' user can result in broken permissions and conflicting behaviour with the system package manager, possibly rendering your system unusable. It is recommended to use a virtual environment instead: https://pip.pypa.io/warnings/venv. Use the --root-user-action option if you know what you are doing and want to suppress this warning.

In [1]:
import pandas as pd

In [3]:
import numpy as np

In [24]:
df=pd.DataFrame(np.arange(3),index=None)
df

   0
0  0
1  1
2  2

# Create series from dictionary

In [26]:
dictionary=[
    {"Name":"A","Age":23,"Location":"Mysore"},
    {"Name":"B","Age":24,"Location":"Simikot"},
    {"Name":"C","Age":23,"Location":"Coimbatore"},
]

df=pd.DataFrame(dictionary)
df

In [27]:
df

  Name  Age    Location
0    A   23      Mysore
1    B   24     Simikot
2    C   23  Coimbatore

In [7]:
df=pd.read_csv("../Sample Data/housing.csv")
df2=df.copy()
df2['longitude1']=df['longitude']
df2

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,ocean_proximity,longitude1
0,-122.23,37.88,41.0,880.0,129.0,322.0,126.0,8.3252,452600.0,NEAR BAY,-122.23
1,-122.22,37.86,21.0,7099.0,1106.0,2401.0,1138.0,8.3014,358500.0,NEAR BAY,-122.22
2,-122.24,37.85,52.0,1467.0,190.0,496.0,177.0,7.2574,352100.0,NEAR BAY,-122.24
3,-122.25,37.85,52.0,1274.0,235.0,558.0,219.0,5.6431,341300.0,NEAR BAY,-122.25
4,-122.25,37.85,52.0,1627.0,280.0,565.0,259.0,3.8462,342200.0,NEAR BAY,-122.25
...,...,...,...,...,...,...,...,...,...,...,...
20635,-121.09,39.48,25.0,1665.0,374.0,845.0,330.0,1.5603,78100.0,INLAND,-121.09
20636,-121.21,39.49,18.0,697.0,150.0,356.0,114.0,2.5568,77100.0,INLAND,-121.21
20637,-121.22,39.43,17.0,2254.0,485.0,1007.0,433.0,1.7000,92300.0,INLAND,-121.22
20638,-121.32,39.43,18.0,1860.0,409.0,741.0,349.0,1.8672,84700.0,INLAND,-121.32
20639,-121.24,39.37,16.0,2785.0,616.0,1387.0,530.0,2.3886,89400.0,INLAND,-121.24

In [8]:
df2.describe()

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value,longitude1
count,20640.000000,20640.000000,20640.000000,20640.000000,20433.000000,20640.000000,20640.000000,20640.000000,20640.000000,20640.000000
mean,-119.569704,35.631861,28.639486,2635.763081,537.870553,1425.476744,499.539680,3.870671,206855.816909,-119.569704
std,2.003532,2.135952,12.585558,2181.615252,421.385070,1132.462122,382.329753,1.899822,115395.615874,2.003532
min,-124.350000,32.540000,1.000000,2.000000,1.000000,3.000000,1.000000,0.499900,14999.000000,-124.350000
25%,-121.800000,33.930000,18.000000,1447.750000,296.000000,787.000000,280.000000,2.563400,119600.000000,-121.800000
50%,-118.490000,34.260000,29.000000,2127.000000,435.000000,1166.000000,409.000000,3.534800,179700.000000,-118.490000
75%,-118.010000,37.710000,37.000000,3148.000000,647.000000,1725.000000,605.000000,4.743250,264725.000000,-118.010000
max,-114.310000,41.950000,52.000000,39320.000000,6445.000000,35682.000000,6082.000000,15.000100,500001.000000,-114.310000

In [10]:
df2.index

RangeIndex(start=0, stop=20640, step=1)

In [11]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 20640 entries, 0 to 20639
Data columns (total 11 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           20640 non-null  float64
 1   latitude            20640 non-null  float64
 2   housing_median_age  20640 non-null  float64
 3   total_rooms         20640 non-null  float64
 4   total_bedrooms      20433 non-null  float64
 5   population          20640 non-null  float64
 6   households          20640 non-null  float64
 7   median_income       20640 non-null  float64
 8   median_house_value  20640 non-null  float64
 9   ocean_proximity     20640 non-null  object
 10  longitude1          20640 non-null  float64
dtypes: float64(10), object(1)
memory usage: 1.7+ MB

In [32]:
list_of_list=[['Hi',10],['Hello',20],['Bye',30]]
df=pd.DataFrame(list_of_list,columns=['Name','Age'],index=['A','B','C'])
df

    Name  Age
A     Hi   10
B  Hello   20
C    Bye   30

In [16]:
tuple_of_tuple=(('Hello',21),('Hi',22),('Bye',23))
df=pd.DataFrame(tuple_of_tuple,columns=['Name','Age'])
df

    Name  Age
0  Hello   21
1     Hi   22
2    Bye   23

# loc

In [17]:
# single row
df.loc[0]

Name    Hello
Age        21
Name: 0, dtype: object

In [19]:
# multiple row
df.loc[[0,1,2]] # syntax df.loc[[list of rows]]

    Name  Age
0  Hello   21
1     Hi   22
2    Bye   23

In [21]:
# multiple row
df.loc[0:1] # syntax df.loc[start row:end row]

    Name  Age
0  Hello   21
1     Hi   22

In [23]:
# single column 
df.loc[0:1,'Age']

0    21
1    22
Name: Age, dtype: int64

In [26]:
# multiple column 
df.loc[:,['Name','Age']] # syntax df.loc[[selected rows list], [selected columns list]]

    Name  Age
0  Hello   21
1     Hi   22
2    Bye   23

# Change index

In [39]:
df1=df.set_index('Name') # set_index return a new data set
df1

       Age
Name
Hi      10
Hello   20
Bye     30

In [43]:
df2.iloc[:,1]

0        37.88
1        37.86
2        37.85
3        37.85
4        37.85
         ...
20635    39.48
20636    39.49
20637    39.43
20638    39.43
20639    39.37
Name: latitude, Length: 20640, dtype: float64

In [38]:
df.iloc[0:1,0:1]

  Name
A   Hi

# column rename

In [44]:
df2=df.rename(columns={'Age':'AGE'})

In [45]:
df2

    Name  AGE
A     Hi   10
B  Hello   20
C    Bye   30

# column delete

In [51]:
df3=df2.drop('Name',axis=1)
df3

   AGE
A   10
B   20
C   30

# row delete

In [53]:
df4=df.drop('A',axis=0)
df4

    Name  Age
B  Hello   20
C    Bye   30

# assigning value

In [55]:
df.loc['B','Name']="Hi"
df

  Name  Age
A   Hi   10
B   Hi   20
C  Bye   30

# iteration

In [56]:
for i,series in df.iterrows():
    print(i,series)

A Name    Hi
Age     10
Name: A, dtype: object
B Name    Hi
Age     20
Name: B, dtype: object
C Name    Bye
Age      30
Name: C, dtype: object

In [57]:
for i in df.itertuples(index=False):
    print(i)

Pandas(Name='Hi', Age=10)
Pandas(Name='Hi', Age=20)
Pandas(Name='Bye', Age=30)

# Sorting

In [58]:
df5=df.sort_values('Age')

In [59]:
df5

  Name  Age
A   Hi   10
B   Hi   20
C  Bye   30

In [61]:
df.sort_values('Age',ascending=False)

  Name  Age
C  Bye   30
B   Hi   20
A   Hi   10

# filtering

In [66]:
df.loc[(df['Age']<30) & (df['Age']>10)]

  Name  Age
B   Hi   20

# Practice: https://leetcode.com/problems/big-countries/

In [67]:
# solution
import pandas as pd

def big_countries(world: pd.DataFrame) -> pd.DataFrame:
    ans=world.loc[(world['area']>=3000000) | (world['population']>=25000000)]
    
    return ans.loc[:,['name','population','area']]

# Practice https://leetcode.com/problems/recyclable-and-low-fat-products/description/

In [68]:
import pandas as pd

def find_products(products: pd.DataFrame) -> pd.DataFrame:
    ans=products.loc[(products['low_fats']=="Y") & (products['recyclable']=="Y")]
    return ans.loc[:,['product_id']]